// 0.Вывести квадрат числа
Console.WriteLine("Введите число");
int a=int.Parse(Console.ReadLine());
Console.WriteLine("Квадратом числа "+a+" является "+a*a);
